/*
 * 校园导游咨询
 * 
 * 问题描述：
 * 设计一个校园导游程序，为来访的客人提供各种信息查询服务。
 * 
 * 需求分析：
 * （1）设计学校的校园平面图，所含景点不少于10个。以图中顶点表示校内
 * 各景点，存放景点代号、名称、简介等信息；以边表示路径，存放路径长度
 * 等相关信息。
 * （2）为来访客人提供图中任意景点相关信息的查询。
 * （3）为来访客人提供图中任意景点之间的问路查询，即查询任意两个景点
 * 之间的一条最短的简答路径。
 * 
 * 测试数据：
 * 由读者根据实际情况指定。
 * 
 * 实现提示：
 * 一般情况下，校园的道路是双向通行的，可设校园平面图是一个无向图。顶
 * 点和边均含有相关信息。
 */

#include "iostream"
#include "string"
using namespace std;

#define NUM 10

#define MAX (int)(INT_MAX / 10)

int dist[NUM+1][NUM+1];		//两个景点之间边的距离
int mind[NUM + 1][NUM + 1];	//两点间的最短路径
int path[NUM + 1][NUM + 1];	//两点间经过的景点

void map();
void distance();
void operation();
void introduce();
void shortestpath();
void floyd();
void show(int i, int j);
//void showtest();

//绘制校园地图
void map() {
	cout << "您现在来到的是杭州电子科技大学。" << endl;
	cout << "杭州电子科技大学始建于1956年，是浙江省人民政府与国防科技工业局共建的教学研究型大学，是浙江省首批重点建设的五所高校之一。" << endl;
	cout << endl;
	cout << "杭州电子科技电子科技大学总共有十大景观，分别是" << endl;
	cout << "1号景点：长虹揽月\n2号景点：巨碟邀星\n3号景点：雅湖云影\n4号景点：书海风荷\n5号景点：兰亭春晓" << endl;
	cout << "6号景点：艺苑秋歌\n7号景点：丛鱼听学\n8号景点：三省问天\n9号景点：藤廊寄梦\n10号景点：麦野浮金" << endl;
	cout << "如下是，该校校区的导航图：" << endl;
	cout << "            1" << endl;
	cout << "           * *" << endl;
	cout << "          *   *" << endl;
	cout << " 2 * * * 3 * * 4 * * * 5" << endl;
	cout << "    *  *        *  *" << endl;
	cout << "      6          7" << endl;
	cout << "     *   *    *   *" << endl;
	cout << "    *       8      *" << endl;
	cout << "   *   *       *    *" << endl;
	cout << "   9               10" << endl;
}

//设置景点之间的路径长度
void distance() {
	//初始化
	for (int i = 0; i < NUM + 1; i++) {
		for (int j = 0; j < NUM + 1; j++) {
			dist[i][j] = MAX;
		}
	}
	//设置路径
	dist[1][3] = dist[3][1] = 2;
	dist[1][4] = dist[4][1] = 2;
	dist[2][3] = dist[3][2] = 3;
	dist[2][6] = dist[6][2] = 1;
	dist[3][4] = dist[4][3] = 2;
	dist[4][5] = dist[5][4] = 3;
	dist[4][7] = dist[7][4] = 1;
	dist[5][7] = dist[7][5] = 1;
	dist[6][8] = dist[8][6] = 1;
	dist[6][9] = dist[9][6] = 3;
	dist[7][8] = dist[8][7] = 1;
	dist[7][10] = dist[10][7] = 3;
	dist[8][9] = dist[9][8] = 1;
	dist[8][10] = dist[10][8] = 1;

	dist[1][1] = dist[2][2] = dist[3][3] = dist[4][4] \
		= dist[5][5] = dist[6][6] = dist[7][7] = dist[8][8] \
		= dist[9][9] = dist[10][10] = 0;
}

//操作接收
void operation() {
	int k;
	cout << endl;
	cout << "请选择你想要进行的下一步操作：" << endl;
	cout << "1：景点信息查询\n2：景点最短路径查询\n3：退出" << endl;
	cin >> k;
	switch (k) {
	case 1:
		cout << "******欢迎进入景点信息查询系统******" << endl;
		introduce();
		break;
	case 2:
		cout << "******欢迎进入校区路径查询系统******" << endl;
		shortestpath();
		break;
	case 3:
		exit(0);
	default:
		cout << "您的信息输入格式有误，请重新输入！" << endl;
		break;
	}
}

//景点信息查询系统
void introduce() {
	int k;
	while (1) {
		cout << "请输入你要查询的景点代号(1~10):" << endl;
		cout << "退出系统请按0" << endl;
		cin >> k;
		switch (k) {
		case 0:
			return;
		case 1:
			cout << "长虹揽月，\n位于杭州电子科技大学正门，是学校标志性建筑，有亚洲首个最宽校门之称。\
高近30米，上书“杭州电子科技大学”几个大字，宽75米，如一道长虹擎起优美的弧线，将其侧月雅湖揽入怀中。学校\
前身为创建于1956年的杭州航空工业财经学校，“敢上九天揽月”的精神一直激励着杭电人坚守信念、脚踏实地，朝着\
梦想前进。万千师生由此而入，开启征程，走向未来。" << endl;
			break;
		case 2:
			cout << "巨碟邀星，\n位于学校体育馆，是杭州市第二大体育馆。体育馆坚若磐石、恢弘大气，又因\
外型酷似飞碟，被学子们戏称为杭电“UFO”。这里不仅是学校各大体育赛事的承办地，更是开学典礼、毕业典礼、各大\
晚会及学科竞赛总决赛的见证地。作为曾经的万马篮球队的主场，这里还承办过第八届全国残疾人运动会轮椅篮球赛，\
《奔跑吧兄弟》第二季拍摄也在此进行。名人集聚，星光璀璨，熠熠生辉。该景点倡导学子“笃行之”。" << endl;
			break;
		case 3:
			cout << "雅湖云影，\n位于学校东南角。月雅湖如一枚碧玉镶嵌于校门之旁，又似一位佳人依偎于大\
草坪之畔。周围有一雅廊点缀，一弯露台探入湖中，远观似在水一方。景名语出朱熹《观书有感》“半亩方塘一鉴开，\
天光云影共徘徊。问渠哪得清如许？为有源头活水来” ，以此鼓励学子心灵澄明，以开明宽阔的胸襟，接受鲜活的知\
识和思想。该景点倡导学子“明辨之”。" << endl;
			break;
		case 4:
			cout << "书海风荷，\n位于校图书馆及其前方荷园，是校园十景中的盛夏之景。图书馆乃大学之重地\
，知识之殿堂。古云“小荷才露尖尖角”，勤学之子犹如初生之荷，在书海的映照下焕发勃勃生机。旖旎的池畔风荷与\
庄严的图书馆相互映照，清淡的荷香与高雅的书香相互氤氲。每逢六月，临别的毕业学子多在此留影，书馆、荷影、\
人面交相辉映，美不胜收，遂成一景。该景点倡导学子“博学之”。" << endl;
			break;
		case 5:
			cout << "兰亭春晓，\n位于月雅湖畔西北角的花园。此亭乃仿文一校区“小兰亭”所建，寄托了杭电人\
对老校区的依依情怀。文一校区为全国四百家绿化先进单位，其中心花园，护土叠石，砌阶敷径，广种佳木，间植花\
卉，中有“士子苑”与“小兰亭”，各别点缀，多有蕴涵。此处虽弹丸之地，然落英缤纷，层绿绕园，曲径通幽，移步换\
景。学子在此间或咏或叙或思或憩，是为校园最幽处。" << endl;
			break;
		case 6:
			cout << "艺苑秋歌，\n位于文化活动中心，为学校艺术荟萃之地，曾举办过第七届中国艺术节、大学\
生电影节，是“高雅艺术进校园”的演出基地。杭电素有原创音乐文化，培育了不少原创歌手，从摇滚巨星郑钧、音乐\
才子杨一、音乐小精灵陈悠悠到“中国最强音”刘瑞琦。这里孕育了1900原创影音工作室，已成为杭电原创艺术才子的“\
孵化器”。" << endl;
			break;
		case 7:
			cout << "丛鱼听学，\n位于第十一教研楼与第十二教研楼之畔的东溪。溪中红鱼成群，自由嬉闹，惹人\
怜爱。东溪丛鱼在教学楼下听学已久，日夜熏陶，似有灵性。闲暇时，学子浅坐岸边，人鱼同乐，好不惬意。清华大学\
老校长梅贻琦先生曰“学校犹水也，师生犹鱼也，其行动犹游泳也，大鱼前导，小鱼尾随，是从游也。”该景点倡导学子“\
审问之”。" << endl;
			break;
		case 8:
			cout << "三省问天，\n位于校园中轴线上的问天广场，乃学校正中心的大型雕塑。三根石柱擎天而立，\
柱身刻有各类象征符号，分别代表过去、现在和未来，上方有一圆轮连接三根石柱，象征时光的车轮滚滚向前，不断轮\
回。子曰“吾日三省吾身”，屈原亦有《天问》之作，于此处，思前贤，低头可躬身自问，仰头可探究苍穹。该景点倡导\
学子“慎思之”。" << endl;
			break;
		case 9:
			cout << "藤廊寄梦，\n位于学生生活区“文一苑”的校友主题公园。廊长百余米，蜿蜒于宿舍楼下，上覆\
紫藤，每到春天，花开满廊，别有韵味，廊间镌刻校友寄语。杭电被誉为“中国IT企业家的摇篮”，知名校友企业有阿里\
巴巴集团、熊猫集团、海尔集团、长虹集团、海信集团、京东方集团等。校友们的励志寄语，激励着学子不断追求梦想\
，超越自我。" << endl;
			break;
		case 10:
			cout << "麦野浮金，\n位于学校体育场北侧麦园。学校素来倡导学子走出宿舍，奔向操场，增强体质，\
健康生活。多年来，杭电“阳光体育”运动走在全省前列，学校获教育部“阳光体育冬季长跑活动”先进单位称号。每年5、\
6月，麦子成熟的季节，金色饱满的麦粒散发出诱人的香甜，学子在体育场内挥洒汗水后，移步北侧，走入麦园，即可陶\
醉于熏风麦浪之中，拥抱大自然，感受丰收的喜悦。" << endl;
			break;
		default:
			cout << "您的信息输入格式有误，请重新输入！" << endl;
			break;
		}
		cout << endl;
	}
}

//最短路径查询系统
void shortestpath() {
	while (1) {
		int i, j;
		cout << "请输入你要查询的两个景点的编号(1~10):" << endl;
		cout << "退出系统请按0" << endl;
		cin >> i;
		if (i == 0) {
			return;
		}
		cin >> j;
		//defend
		if (i > NUM || i < 0 || j > NUM || j <= 0) {
			cout << "您的信息输入格式有误，请重新输入！" << endl;
			cout << endl;
			continue;
		}
		else {
			floyd();
		//	showtest();
			show(i, j);
			cout << endl;
		}
	}
}

//Floyd算法求点到点的最短路径
void floyd() {
	//各对结点之间初始已知路径及距离
	for (int i = 1; i <= NUM; i++) {
		for (int j = 1; j <= NUM; j++) {
			mind[i][j] = dist[i][j];
			path[i][j] = 0;
		}
	}
	for (int k = 1; k <= NUM; k++) {
		for (int i = 1; i <= NUM; i++) {
			for (int j = 1; j <= NUM; j++) {
				if (mind[i][k] + mind[k][j] < mind[i][j]) {
					mind[i][j] = mind[i][k] + mind[k][j];
					path[i][j] = k;		//记录从i到j的最短路径上点j的前驱结点的序号
					path[j][i] = k;	
				}
			}
		}
	}
}

void showtest() {
	for (int i = 1; i < NUM; i++) {
		for (int j = 1; j < NUM; j++) {
			cout << mind[i][j] << ' ';
		}
		cout << endl;
	}
}

//输出两个节点之间的最短路径和经过的节点
void show(int i, int j) {
	int m = i;
	int n = j;
	string str;
	if (mind[i][j] == MAX) {
		cout << "非常抱歉，从m到n的道路不通" << endl;
		return;
	}
	else {
		if (m < n) {
			str = (n + '0');
			while (path[m][n] != 0) {
				str += " >- ";
				str += (path[m][n] + '0');
				n = path[m][n];
			}
			str += " >- ";
			str += m + '0';
			//倒叙输出str
			int len = str.length();
			char temp;
			for (int k = 0; k < len / 2; k++) {
				temp = str[k];
				str[k] = str[len - k - 1];
				str[len - k - 1] = temp;
			}
			cout << str << endl;
			cout << "总距离是" << mind[i][j] << endl;
		}
		else {
			cout << m;
			while (path[m][n] != 0) {
				cout << " -> " << path[m][n];
				m = path[m][n];
			}
			cout << " -> " << n << endl;
			cout << "总距离是" << mind[i][j] << endl;
		}
	}
}


int main() {
	map();
	distance();
	while (1) {
		operation();
	}
	return 0;
}







